import React from "react";
import { motion } from "framer-motion";
import AboutUsCard from "./AboutUsCard";

const des = [
  "شركة نماء للاستثمار واستصلاح الأراضى – 1033 فدان (434 هكتار )",
  "شركة الفا هيرب للنباتات الطبية والعطرية – 1800 فدان (756 هكتار )",
  "باسقات لإقامة وإدارة  وبيع مزارع النخيل للغير- 750 فدان (294 هكتار )",
  "أنشطة البحث والتطوير ",
];

const des2018 = [
  ".تم تأسيس شركة نماء للاستثمار واستصلاح الأراضى بهدف استصلاح الأراضى الصحراوية للمجموعة والمقاولات الزراعية لدى الغير",
  ".تم اختيار مركز الفرافرة- محافظه الوادي الجديد لإنشاء المشروع الزراعى ",
  ".تم استصلاح اول 20 فدان وبدا حفراول بير ",
  ".فى 16 اغسطس 2018  تم تدشين اول بير  ",
  ".تم إتمام المساحة إلى 50  فدان وتم تركيب  الشبكه بطريقة  الري الغمر  ",
  ".وتمت زراعة المساحة بمحصول القمح بهدف الاستصلاح ",
];
const des2019 = [
  ".تم تركيب اول محطه طاقه شمسيه على نفس البير بقدره 80 كيلو وات ",
  ".تم زراعة 50 فدان برسيم حجازي ",
  ".خرجت شركة باسقات للنور - زراعه 30 فدان نخيل سيوي ",
  ".بدأ فريق البحث والتطوير بزراعة مساحه 4 فدان ليمون وبعض أشجار الفواكه ",
];
const des2021 = [
  ".بداية الاستثمار فى الانتاج الحيوانى فى تسمين الماشية على البرسيم الحجازى من انتاج مزارعنا كذلك تم إنشاء مشروع الأغنام البرقى بهدف الإكثار والتوسع الرأسى من إنتاج البرسيم الحجازى ",

  ".زراعة مساحة 75 فدان ريحان حيوى ",
  ".زراعة مساحة 35 فدان شبت حيوى و35 فدان بقدونس حيوى ",
  ".قامت باسقات بزراعة 50 فدان نخيل سيوى ",
  ".قام فريق البحث والتطوير بزراعة 10 فدان نعناع  فلفلى ",
];
const des2022 = [
  ".إضافة مساحة 100 فدان للزراعات الحيوية ( نعناع بلدى ) ",
  ".تم استيراد المرحلة الأولى من معدات النباتات الطبية والعطرية اللازمة للزراعة والحصاد ",
  ".تم إنشاء عدد 2 صوبه زراعية الأولى على مساحه 4000 م2 تقريبا لتكون مشتل لفسائل النخيل وبدأنا بعدد 6000 فسيله من نوع النخيل السيوي ",
  ".والثانية على مساحة 1000 م2 لاستيعاب عدد 1500 فسيلة ",
];
const des2023 = [
  ".خرجت شركة الفا هيرب للنور  لتحويل النشاط الزراعى لغرض التصنيع والتصدير , وبدأت بإضافة  مساحة 150 فدان من الزراعة العضوية (نعناع فلفلى) ",
  ".تم إنشاء وتسويق وبيع  برج سكنى بهدف التنوع الاستثمارى  ",
  " :أعمال فريق البحث والتطوير  ",
  ".زراعة 10 فدان كاموميل  حيوى على أرض طفلية بنظام الغمر ",
  ".زراعة أحواض الترسيب بأنواع أسماك البلطى والبورى والطوبار بهدف تعظيم الربحية وتوفير الأزوت الحيوى والتنوع البيئى والبيولوجى , وبدأنا بعدد 8000 سمكة ",
  ".زراعة عدد 10 فدان من نبات الاستيفيا ",
];

const OurStory = () => {
  return (
    <motion.div
      initial={{ opacity: 0 }}
      animate={{ opacity: 1, transition: { duration: 0.5 } }}
      className="w-full flex flex-col gap-10 lg:gap-15 text-end"
    >
      {/* part one */}
      <div>
        <div className="py-6 font-cairo flex flex-col gap-4">
          <p className="text-sm text-blueColor tracking-[4px]">2024 - 2018</p>
          <h2 className="text-3xl md:text-4xl font-bold">قصتنا</h2>
        </div>
        <div className="mt-6 w-full border-l-[6px] border-l-black border-opacity-30 flex flex-col gap-10 ">
          <AboutUsCard
            title="تاسست المجموعة في 2018
            على مساحة 3600 فدان (1500 هكتار تقريباً ) 
            "
            subTitle="تتكون من"
            result=""
            des={des}
          />
          <AboutUsCard title="" subTitle="" result="عام 2018" des={des2018} />
          <AboutUsCard title="" subTitle="" result="عام 2019" des={des2019} />
        </div>
      </div>
      {/* part two */}
      <div>
        <div className="mt-6 lg:mt-14 w-full border-l-[6px] border-l-black border-opacity-30 flex flex-col gap-10 ">
          <AboutUsCard
            title=""
            subTitle=""
            result="عام 2020 - 2021"
            des={des2021}
          />
          <AboutUsCard title="" subTitle="" result="عام 2022" des={des2022} />
          <AboutUsCard title="" subTitle="" result="عام 2023" des={des2023} />
        </div>
      </div>
    </motion.div>
  );
};

export default OurStory;
