import React from "react";
import { motion } from "framer-motion";

const des = [
  ".وجود المياه العذبة فهي مياه ابار وتتمتع بدرجة ملوحة اقل من 350  350 جزء في المليون ",
  ".جوده التربة حيث ان التربة بكر لم يسبق زراعتها قبل الان وهي وتحتوي كل الانواع بين الرملية والطفلية والخليط ",
  ".الطرق الممهدة التي تصل الى كل وحدة في المزرعة ",
  ".المشاريع الزراعية هي امان المستقبل وهي اتجاه العالم في هذه المرحلة خصوصا وان المشروع معد زراعيا ليتناسب مع التصنيع والتصدير لكل دول العالم ",
  ".المعدات التي تمتلكها الشركة لتسهيل  عمليات الزراعة والحصاد والتجهيز ",
  ".فريق العمل المتميز الذي يتمتع بخبرة عالية في الادارة والزراعية والحصاد والتجهيز  ",
  ".كما يتمتع فريق العمل ومجلس الادارة بامكانية الوصول لمجموعة من المستشارين في شتى المجالات الادارية والزراعية والتخطيط الاستراتيجي  وادارة الاموال والتسويق والمبيعات ",
  ".تجهيز السكنات واقامة فرق العمل داخل كل وحدة من وحدات المشروع حيث ان الاقامة كاملة على مدار اليوم والليلة ",
  ".العمل دوما على الزراعة العضوية وتوفير الاحتياجات والمواصفات العالمية  ",
  ".التنوع البيئي والبيولوجي حيث تم اقامة مشاريع الاحواض السمكية لتوفير الازوت والانتاج الحيواني لتكوين الكمبوست والمواد العضوية اللازمة للزراعة كما إنها تحقق هامش ربح كوحدات منفصلة  ",
  ".التنوع الاستثماري ما بين المقاولات الزراعية والمقاولات العامة و الزراعات التقليدية والانتاج الحيواني والاستزراع السمكي والزراعات العضوية بغرض التصنيع والتصدير ",
  ".مطابقة المنتجات للمواصفات العالمية  ",
  ".امكانية التوسع في نفس المكان حيث لدينا اضعاف المساحة للتوسع حتى تقل المصروفات ويتم تحقيق أعلى ربحية ",
  ".استغلال موارد البيئة من حراره الشمس والجو الجاف في التجفيف الشمسي مما يوفر الطاقة اللازمة للتجفيف ",
  ".امكانية التجهيز الخام داخل المزرعة وجود جزء من معدات التجهيز ",
  ".الخبرة في المجال والتركيز والتفرغ ",
  ".التكامل في  الهدف والاستدامة في كل مرحلة من مراحل المشروع ",
];

const StrengthPoint = () => {
  return (
    <motion.div
      initial={{ opacity: 0 }}
      animate={{ opacity: 1, transition: { duration: 0.5 } }}
      className="w-full flex flex-col gap-10 lg:gap-15 text-end"
    >
      {/* part one */}
      <div>
        <div className="py-6 font-cairo flex flex-col gap-4">
          <p className="text-sm text-blueColor tracking-[4px]">2024 - 2018</p>
          <h2 className="text-3xl md:text-4xl font-bold">
            إمكانياتنا ونطاق القوة
          </h2>
        </div>
        <div className="mt-6 w-full flex flex-col gap-10">
          <div className="w-full h-1/3 group flex ">
            <div className="w-full bg-bgGrayColor bg-opacity-20 hover:bg-opacity-90 duration-700  rounded-lg p-4 lg:px-10 flex flex-col gap-6 lg:gap-10 shadow-shadowOne ">
              <div className="text-lg font-medium group-hover:text-white duration-300 ">
                <div className="my-10" />
                {des.map((item) => (
                  <div className="flex flex-row justify-end mb-10 lg:mb-12 text-2xl border-b-2 border-blueColor/50">
                    <p className=" mb-5"> {item} </p>
                    <span className="ml-3"> - </span>
                  </div>
                ))}
              </div>
            </div>
          </div>
        </div>
      </div>
    </motion.div>
  );
};

export default StrengthPoint;
